{
  "Site": "cnn",
  "URL": "https://www.cnn.com",
  "TopHeadlines": [
    {
      "NewsArticle": [
        {
          "Title": "Speaker Johnson unveils plan to avert shutdown",
          "Description": "The two-step plan — unveiled just days before Friday’s deadline — is already facing criticism from Democrats and RepublicansHere’s what’s included in the GOP two-step government funding planFederal government begins initial communications on possible shutdownRFK Jr. is polling at historic levels for an independentHe’s second in line to the presidency. Financially, he’s just getting byA third-party run is a risk we can’t affordTrump plots mass detention and deportation of undocumented immigrants should he regain powerBiden is in troubleShe led the National School Walkout after the Parkland mass shooting. Then she left the USSmerconish shares his fill-in-the-blanks script for US mass shootingsPro-Palestinian demonstrators rally in London, Brussels, Paris and near Biden’s Delaware homeGaza doctors are desperate for help. Americans are stepping up to answer the callThree babies die as Israel besieges Gaza’s largest hospital, health officials sayDo Palestinian lives matter to the world?Police crack down on counter protesters at pro-Palestinian marchWatch the latest CNN HeadlinesThere’s probably no monster in Loch Ness. But we found one of its secretsHaving children is a risk I’m unwilling to takeWaPo cartoonist responds to criticism from Hamas ‘human shields’ cartoonThis uncomfortable portrait of femininity has resonated for four decadesSoccer player Raphael Dwamena dies at age 28 after collapsing during a matchEx-GOP senator was sexually assaulted while jogging. Hear how she confronted her attackerGordon Ramsay welcomes sixth child to his ‘brigade’ with wife Tana RamsayHere’s what the new IRS tax brackets mean for youHere’s one more reason to stop shaming parents",
          "AritcleURL": "https://us.cnn.comhttps://www.cnn.com/2023/11/11/politics/house-speaker-mike-johnson-pitches/index.html"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "",
          "Description": "US military aircraft crashes in training accident in eastern Mediterranean SeaAustin police officer killed, 2 hostages found dead after shootout, authorities say‘I have nothing to hide’: New York City mayor’s phones seized by FBIFederal appeals court sets deadline for Louisiana Legislature to decide whether to change challenged congressional mapRelationship expert: ‘We can live without sex but we can’t live without touch’Lowering salt intake by 1 teaspoon works as well as drugs, study saysTrump asks for federal election trial to be televised, wants it seen by ‘everybody in the world’IRS announces new income tax bracketsUkraine releases drone video purporting to show massive losses of Russian weaponsIceland declares state of emergency, evacuates residents over threat of volcanic eruptionWhy do volcanoes erupt?First atmospheric river storm of the season targets California next week‘Be prepared for all outcomes’: Inside the saga of a supervolcano that’s waking upAmazon deforestation falls more than 20% to its lowest levels in 5 yearsHumanity just lived through the hottest 12 months in at least 125,000 yearsThey went hunting for fossil fuels. What they found could help save the worldCould the West Bank “model” work for Gaza?Obama’s message of hope – 15 years later",
          "AritcleURL": "https://us.cnn.com/2023/11/11/politics/military-aircraft-accident-mediterranean-sea/index.html"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "",
          "Description": "Canadians created a new holiday. Now it’s being celebrated in this US cityA Brooklyn teen became the final US combat death of World War II, just as Japan was surrenderingBiden honors Americans who ‘stood on the front lines of freedom’ in Veterans Day remarksDespite racism and discrimination, they felt called to fight for their countryWhy this common, but overlooked ‘mid-size’ body type is taking over TikTokPope removes outspoken conservative Texas bishop after investigation57% of readers who took this week’s news quiz got 8 or more questions right. How will you do?F1 car comes apart during crash. Green Bay defender turns LA QB’s helmet with face mask grab. The week in photosThis was a massive week for AIThe US minimum wage has been $7.25 since 2009. Here’s what that meansGina Raimondo seeks better ties with China amid tensions over tech, TaiwanThe wildest moments of WeWork’s rise",
          "AritcleURL": "https://us.cnn.com/videos/us/2023/11/11/first-black-veterans-day-buffalo-us-seg-blackwell-foa-vpx.cnn"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "Best-in-class\n\t\n\nGift Guides\n\t\n\nInflation-busting deals",
          "Description": "After testing a dozen leaf blowers, these two stood outYes, robot mops are a thing. These 3 are worth your moneyYeti has launched the Rambler Wine Chiller just in time for holiday entertainingHow to deal with your stress this year, according to expertsOprah just dropped her 2023 Favorite Things gift guideThe 50 most unique gifts to give (and get) this holiday seasonThe 61 best gifts for men that we know he’ll loveA ton of Lego Advent calendars just hit their lowest price everThe Macy’s early Black Friday sale is here — these are the best deals to shopThe best gifts to pick up on your next Target runHere are the 20 best REI Gear Up Get Out deals to shop ahead of winterThese are the 10 best products on sale at Amazon this weekA 4-pack of Apple AirTags is on sale at Amazon todayBest Buy has early Black Friday deals on Apple products, TVs and moreThese are the best sales to shop this weekend",
          "AritcleURL": "https://us.cnn.comhttps://www.cnn.com/cnn-underscored"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "Opinion\n\t\n\nEntertainment",
          "Description": "Barbra Streisand is giving us a wake-up callThis penalty could hurt Trump more than prison timeDo Palestinian lives matter to the world?DoorDash doesn’t understand the definition of a tipWere Covid-19 lockdowns a mistake?Deposit delays are just the latest example of our broken financial systemThe moment ‘Priscilla’ became a horror movie for meJamie Lee Curtis heavily teases ‘Freaky Friday 2’ team-up with Lindsay LohanKeke Palmer granted temporary sole custody of her sonDe Niro’s production company ordered to pay ex-employee $1.2 million in civil caseGrammy nominations 2024: See the full list of nomineesBeyoncé drops new worldwide trailer for ‘Renaissance’",
          "AritcleURL": "https://us.cnn.comhttps://www.cnn.com/opinions"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "Travel\n\t\n\nStyle",
          "Description": "Why this business class innovation may have been a mistakeAir Canada apologizes, pledges to improve accessibilityThe untouched skiing paradise on the edge of EuropeThis European country might add a ‘green tax’ to airplane ticketsPlane takes off with missing window panes as crew fails to spot damage100 passengers injured as ship lurches to a haltA woman with the ‘it’ factor: The enduring appeal of Carolyn Bessette Kennedy‘Bleu Royal’ diamond fetches almost $44 millionPicasso masterpiece depicting his young mistress sells for $139 million at auctionShakespeare portrait sent to edge of space to celebrate 400 years since ‘First Folio’Designer apologizes for using live butterflies in ‘terrarium’ dressesWhat you need to know about the FDA’s proposed ban of brominated vegetable oilThere’s a lingering question after Wegovy’s heart health benefits confirmedScientists create chimeric monkey with two sets of DNABest ways to counter the harmful effects of sitting, according to researchLong Covid is hard — here are five tips to help",
          "AritcleURL": "https://us.cnn.comhttps://www.cnn.com/travel"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "World\n\t\n\nPolitics\n\t\n\nUS",
          "Description": "Pro-Russian official assassinated and Black Sea battles: Here’s what to know about the latest in UkraineIranian president says Saudi meeting is meant to ‘save the Palestinians’British couple died on vacation after adjoining room fumigated for bed bugsDetained, missing or under investigation: Business leaders in China face ‘aggressive’ crackdownRNC backs off on warning candidates about participating in Iowa Christian group’s forumMcCarthy unloads on his GOP critics and says Mace deserves to lose reelection bidHow a nullified election in Connecticut became a rallying cry for Trump supportersJoe Manchin wants to mobilize the middle of the country. What does that even look like?The water turns shocking shade of magenta in this Hawaii refugeSoccer legends take to the field for the last timeMan convicted of murder in deaths of 2 hospital workers sentenced to lifeNew Census projections reveal when the US population may start declining — and a big reason why",
          "AritcleURL": "https://us.cnn.comhttps://www.cnn.com/world"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "CNN podcasts\n\t\n\nSports",
          "Description": "Could the West Bank “model” work for Gaza?Dems win but Biden trailsThe US Army’s recruitment challengeWhy long Covid is more than just ‘brain fog’Obama’s message of hope – 15 years laterDavid Axelrod on Biden’s political futureToxic foam coats sacred river near New Delhi as Indian capital battles hazardous pollutionThe world is planning to blow the fossil fuels production limit that would keep a lid on global heating, report saysClimate change is impacting the home insurance industry and damaging the housing marketThe planet is heating up faster than predicted, says scientist who sounded climate alarm in the 1980sExpert: Why Trump went ‘ballistic’ after learning maid may be questionedMichigan remains undefeated after win vs. Penn StateGiants rookie QB aays he still lives with parentsMichigan interim coach emotional after winNBA announcer rips James HardenFormer NFL 1st-round pick dies at 33",
          "AritcleURL": "https://us.cnn.comhttps://www.cnn.com/audio"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "Represented\n\t\n\nCNN Heroes Top 10",
          "Description": "Australian surfer officially breaks world record after taming giant waveNaomi Osaka set to return to tennis less than six months after giving birthAmerica’s oldest zoo has a new history-making CEOThis CNN Hero offers judgment-free veterinary care for the pets of those experiencing homelessnessMeet the 2023 Top 10 CNN HeroesClick here to cast your vote for CNN Hero of the Year",
          "AritcleURL": "https://us.cnn.comhttps://www.cnn.com/us/represented-by-cnn"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "",
          "Description": "These rescued farm animals are getting a second chance at lifeHaunting underwater photos portray climate change in a new wayThe week in 33 photosThis Black-owned ballet school empowers young dancers",
          "AritcleURL": "https://us.cnn.comhttps://www.cnn.com/interactive/2023/10/world/animal-sanctuaries-cnnphotos/"
        }
      ]
    },
    {
      "NewsArticle": [
        {
          "Title": "",
          "Description": "NYC mayor says he will continue to cooperate with investigation after FBI seizes his phonesMar-a-Lago maid, plumber could testify in Trump criminal caseSAG-AFTRA reveals terms of ‘groundbreaking’ dealSex therapist Dr. Ruth Westheimer appointed New York state’s first loneliness ambassadorDo you tip at a restaurant like Chipotle? Here’s what a survey foundHow lawmakers in Texas and Florida undermine Covid vaccination effortsAmy Coney Barrett shares what happened to that infamous blank notepad from her confirmation hearingsEscape crowds at these affordable alternatives to travel hot spotsIt’s been 25 years since a Black woman won album of the year. Will SZA change that?Apollo astronaut dead at 95",
          "AritcleURL": "https://us.cnn.com/2023/11/10/politics/eric-adams-phones-seized-fbi/index.html"
        }
      ]
    }
  ]
}
